Revit 2027 API
StructuralSectionConcreteT.CantileverLength Property
 Flange cantilever length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CantileverLength { get; set; }
Public Property CantileverLength As Double
	Get
	Set
public:
property double CantileverLength {
	double get ();
	void set (double value);
}
member CantileverLength : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionConcreteT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace